In [3]:
import numpy as np
import pandas as pd

In [5]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [9]:
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [25]:
df.dropna() # Drop every row that has nan values in it

     A    B  C
0  1.0  5.0  1

In [27]:
df.dropna(axis=1) # Drop any column with nan values in it

   C
0  1
1  2
2  3

In [37]:
df.dropna(thresh=2) # This delete any row that has less than 2 not nan values

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [39]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [41]:
df.fillna(value='FILL VALUE')

            A           B  C
0         1.0         5.0  1
1         2.0  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [43]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64